# Personal Tools
cask "1password-cli"
cask "bartender"
cask "dash"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "zed"
brew "zsh"

# Git
brew "gh"
brew "lazygit"
brew "difftastic"

# Cloud
brew "awscli"

tap "hashicorp/tap"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"

# K8s
brew "helm"
brew "k9s"
brew "kubectl"
brew "kubectx"

tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# NATS
tap "nats-io/nats-tools"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"

# Containers
cask "docker"
