# Personal Tools
cask "1password-cli"
cask "bartender"
brew "coreutils"
cask "dash"
brew "fzf"
cask "ghostty"
cask "gpg-suite"
brew "jq"
brew "neovim"
cask "obs"
cask "obsidian"
cask "raycast"
brew "rg"
cask "spotify"
brew "tmux"
brew "tree"
cask "zed"

# shell
brew "zsh"
brew "zsh-autosuggestions"

# Temporary, maybe?
brew "go"

# Git
brew "gh"
brew "lazygit"
brew "difftastic"

# Cloud
brew "awscli"

tap "hashicorp/tap"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"

# K8s
brew "helm"
brew "k9s"
brew "kubectl"
brew "kubectx"

tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# NATS
tap "nats-io/nats-tools"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"

# Containers
cask "docker"
